[
  {
    "civilizationId": 1,
    "history": [
      "The legendary origin of the Aztec people has them migrating from a homeland called Aztlan to what would become modern-day Mexico. While it is not clear where Aztlan was, a number of scholars believe that the Mexica—as the Aztec referred to themselves—migrated south to central Mexico in the 13th century.",
      "The Mexica founding of Tenochtitlan was under direction from their patron god Huitzilopochtli, according to legend. The legend recounts that Huitzilopochtli told them to found their settlement in the place where a giant eagle eating a snake was perched on a cactus. This settlement, in the region of Mesoamerica called Anáhuac located on a group of five connected lakes, became Tenochtitlan. Archaeologists date the founding of Tenochtitlan to 1325 C.E."
    ]
  },
  {
    "civilizationId": 2,
    "history": [
      "The Britons are a Western European civilization in Age of Empires II that represents the English and the Anglo-Normans during the High to Late Middle Ages, with a focus on long-ranged foot archers. Due to good early economic advantages, they are an easy micromanaging archer civilization. The Longbowman is also one of the most dangerous units when massed. Their descendants are the modern English nation, that alongside the Scottish, Welsh and Irish nations (descendants of the Celts). These nations created a united kingdom, the British civilization.",
      "The Britons' main advantages are in their ranged units as they arguably have the best foot archers. They are trained faster and have a very long range. Their infantry is also very good with a complete tech tree. But their mounted units are very underwhelming and their siege weapons are also lacking. This is compensated to a degree by their very dangerous Trebuchets that aim at units with perfect accuracy and deal blast damage thanks to Warwolf. Their navy is strong with a full tech tree apart from Elite Cannon Galleons. The Monks are below average with three technologies missing. Their defensive structures are good, and their economy rather average, although their Shepherd bonus is very helpful early on."
    ]
  },
  {
    "civilizationId": 3,
    "history": [
      "The Byzantines are a Mediterranean European civilization in Age of Empires II (Middle Eastern before the Definitive Edition) based on the empire of the namesake around modern day Greece and Turkey. Although classified as a defensive civilization in-game, they are a versatile civilization in practice, relying on a wide variety of units of all categories for both offense and defense strategies, making the civilization appealing for newer players.",
      "The Byzantines are generally seen as the \"Greek\" civilization in the medieval timeframe. Despite Greece falling into the hands of the Ottoman Empire, the Byzantine civilization is represented in Age of Empires III: Definitive Edition - Knights of the Mediterranean by the Royal Houses of Phanar, based on the Phanariotes (who were direct descendents of Byzantine imperial and aristocratic families, as well as the families of wealthy Greek merchants in the Phanar District of Constantinople). The Phanariot Byzantine Legacy technology also offers an improvement to building hitpoints, similar to the Byzantines' own inherent building hitpoint bonus."
    ]
  },
  {
    "civilizationId": 4,
    "history": [
      "The Celts are a Western European civilization in Age of Empires II based on medieval Ireland and Scotland. They focus on infantry and siege weapons. As the Celts are the official tutorial civilization from the William Wallace campaign, they are designed as a beginner friendly civilization for newer players thanks to their economic bonuses and non-conditional bonuses for their infantry and siege.",
      "Their descendants are the Scottish and Irish nations. Wales is also considered a Celtic nation, but is not represented by the Celtic civilization. These three nations came under control of the English nation (descendants of the Britons), which created a united kingdom: the British civilization featured in Age of Empires III. Hence they do not reappear as such, but Morgan Black and the Highlander are descended from them."
    ]
  },
  {
    "civilizationId": 5,
    "history": "Ancient China is responsible for a rich culture, still evident in modern China. From small farming communities rose dynasties such as the Zhou (1046-256 B.C.E), Qin (221-206 B.C.E), and Ming (1368-1644 C.E.). Each had its own contribution to the region. During the Zhou Dynasty, for example, writing was standardized, iron working refined, and famous thinkers like Confucius and Sun-Tzu lived and shared their philosophies. During the Qin Dynasty, Qin Shi Huang commissioned the Terracotta Army, and the Ming Dynasty refurbished the Great Wall to protect the nation from Mongol attacks."
  },
  {
    "civilizationId": 6,
    "history": [
      "The Franks (also known as the French) are a Western European civilization in Age of Empires II based on modern day France. The Franks focus on cavalry. Due to the Franks' straight-forward civilization bonuses on their cavalry and strong early-game economic bonuses, the Franks are an appealing civilization for newer and veteran players alike who want to specialize in the \"Knight rush\" strategy.",
      "The Franks were the ancestors to the French, who also appear in Age of Empires III and Age of Empires IV (much like the Franks, the French are depicted in the successor games as cavalry-focused civilization with strong economic bonuses and beginner-friendly mechanics)."
    ]
  },
  {
    "civilizationId": 7,
    "history": [
      "The Goths are a Central European civilization in Age of Empires II. They focus on infantry.",
      "The Goths were a collection of Eastern Germanic tribes that constantly warred with the Roman Empire during its later years, known for bringing Rome to its knees and traveling all over Europe, bringing devastation with them. Following the fall of the Empire, the Goths divided into the Ostrogoths (East Goths) who settled in Italy, and the Visigoths (West Goths[note 1]) who settled in the region that would later become Portugal and Spain.",
      "In-game, the Goths are an aggressive civilization with a reputation for their Dark Age and Feudal Age infantry rushes, while having the ability to rapidly produce infantry in large numbers in post-Imperial Age, making the Goths one of the hardest civilization to fight in the late game for civilizations who aren't able to diversify their army or unable to close out games before and during the Castle Age. Despite their ability to produce infantry cheaply and quickly in the late game, the Goths other unit options are mediocre or average at best, and do not have long term economic bonuses apart from increased food carry for their hunters (which only helps with their Dark Age and Feudal Age infantry rushes). The Goths are one of the two civilizations without access to Stone Walls.",
      "Their unique unit, the Huskarl, is a highly mobile high-pierce armor anti-archer infantry unit with low base melee armor, reversing the traditional rock-papers-scissors concept with it's relation between archers and infantry. The concept of an anti-archer infantry unit is seen in other installments of Age of Empires games (such as the Norse Huskarl in Age of Mythology, Shock Infantry in Age of Empires III, and the Man-at-Arms unit in Age of Empires IV)."
    ]
  },
  {
    "civilizationId": 8,
    "history": [
      "The Huns are a Central European civilization introduced in Age of Empires II: The Conquerors. They are based on the Hunnic Empire controlled by Attila the Hun. In game, they focus on cavalry with emphasis on early game rushing.",
      "Historically, the Huns were a civilization with no discernible origin besides the steppes of Central Asia that was most active in Eastern Europe during the Middle Ages. They are one of the few civilizations that invaded Eastern Europe and displaced many other \"barbarian\" tribes which caused the Roman Empire to crumble. Much of the depictions of the Huns in-game are based on various Roman descriptions and limited archaeological evidence, as much of their civilization remains unknown to this day."
    ]
  },
  {
    "civilizationId": 9,
    "history": [
      "Around the 3rd century BCE, the Yayoi people from the continent immigrated to the Japanese archipelago and introduced iron technology and agricultural civilization. Because they had an agricultural civilization, the population of the Yayoi began to grow rapidly and ultimately overwhelmed the Jōmon people, natives of the Japanese archipelago who were hunter-gatherers. Between the fourth to ninth century, Japan's many kingdoms and tribes gradually came to be unified under a centralized government, nominally controlled by the Emperor of Japan.",
      "The imperial dynasty established at this time continues to this day, albeit in an almost entirely ceremonial role. In 794, a new imperial capital was established at Heian-kyō (modern Kyoto), marking the beginning of the Heian period, which lasted until 1185. The Heian period is considered a golden age of classical Japanese culture. Japanese religious life from this time and onwards was a mix of native Shinto practices and Buddhism."
    ]
  },
  {
    "civilizationId": 10,
    "history": [
      "The Koreans are an East Asian civilization introduced in Age of Empires II: The Conquerors based on various medieval kingdoms in the Korean peninsula (i.e. Silla, Goryeo and Joseon). They focus on towers and navy.",
      "The Koreans are an example of a turtle civilization, which puts emphasis on strong defensive capacity with their towers, navy, siege weapons, and ranged units (which is emphasized with their unique unit). This makes Koreans a good candidate in closed maps such as Arena and Black Forest and water maps due to their formidable late-game army composition and being to able wall up and play defensively. Despite their strong defensive capacities, their frontline units lack several key technologies (Blast Furnace, Bloodlines, and Plate Barding Armor) and struggle in open maps due to the difficulty on defending and lack of noticeable early game economic and military bonuses apart from their tower rushes (which was nerfed significantly in the Definitive Edition). The Definitive Edition gave the Koreans several buffs that solidify them as an archer rush civilization, making them a viable pick in open maps. The Koreans are noted to be the only civilization to have access to all University upgrades (and they even get tower upgrades for free)."
    ]
  },
  {
    "civilizationId": 11,
    "history": [
      "The Mayans are a Native American civilization introduced in Age of Empires II: The Conquerors. They focus on archers.",
      "In contrast to the Aztecs, the Mayans put more emphasis on their foot archers and have better defenses, but have average Monks and siege and weaker front-line units (in the case of the Mayans, they lack Supplies and Champion upgrades). Despite this, the Mayans are capable of a strong archer rush because their archers are cheaper.",
      "The Mayan army composition puts more emphasis on mobility thanks to their bulkier Eagle Warriors and their unique unit that acts as a pseudo Cavalry Archer. Much like the Aztecs, the Mayans have a strong economy and a unique technology that improves their Skirmishers (in the case of the Mayans, they have a unique technology that allows their Skirmishers to fire an extra projectile). As a Native American civilization, they do not have access to cavalry and gunpowder units.",
      "The Mayans appear as a minor native in Age of Empires III and as a revolution option for the Mexicans in the Definitive Edition."
    ]
  },
  {
    "civilizationId": 12,
    "history": [
      "Mongol empire, empire founded by Genghis Khan in 1206. Originating from the Mongol heartland in the Steppe of central Asia, by the late 13th century it spanned from the Pacific Ocean in the east to the Danube River and the shores of the Persian Gulf in the west. At its peak, it covered some 9 million square miles (23 million square km) of territory, making it the largest contiguous land empire in world history.",
      "The year 1206, when Temüjin, son of Yesügei, was elected Genghis Khan of a federation of tribes on the banks of the Onon River, must be regarded as the beginning of the Mongol empire. This federation not only consisted of Mongols in the proper sense—that is, Mongol-speaking tribes—but also other Turkic tribes. Before 1206 Genghis Khan was but one of the tribal leaders fighting for supremacy in the steppe regions south and southeast of Lake Baikal; his victories over the Kereit and then the Naiman Turks, however, gave him undisputed authority over the whole of what is now Mongolia. A series of campaigns, some of them carried out simultaneously, followed."
    ]
  },
  {
    "civilizationId": 13,
    "history": "The Persian Empire is the name given to a series of dynasties centered in modern-day Iran that spanned several centuries—from the sixth century B.C. to the twentieth century A.D. The first Persian Empire, founded by Cyrus the Great around 550 B.C., became one of the largest empires in history, stretching from Europe’s Balkan Peninsula in the West to India’s Indus Valley in the East. This Iron Age dynasty, sometimes called the Achaemenid Empire, was a global hub of culture, religion, science, art and technology for more than 200 years before it fell to the invading armies of Alexander the Great."
  },
  {
    "civilizationId": 14,
    "history": [
      "The Saracens (also known as the Arabs) are a Middle Eastern civilization in Age of Empires II. They focus on camels and ships. Gameplay wise, the Saracens put emphasis on their camels, Galleys, and Monks. They are also one of the two civilizations in the game to have access to all important upgrades for their Archery Range units (the other being the Japanese).",
      "The Saracens/Arabs as a civilization are also represented as the Abbasid Dynasty in Age of Empires IV. Because the Arab people were conquered by the Ottomans, the Saracens and Arabs do not appear as a playable civilization in Age of Empires III (although several mercenary and outlaw units such as the Mameluke and Desert Archer use Arabic voice lines, with the later using the same voice lines as Saracen military units from Age of Empires II)."
    ]
  },
  {
    "civilizationId": 15,
    "history": "The history of Spain dates to the Antiquity when the pre-Roman peoples of the Mediterranean coast of the Iberian Peninsula made contact with the Greeks and Phoenicians and the first writing systems known as Paleohispanic scripts were developed. During Classical Antiquity, the peninsula was the site of multiple successive colonizations of Greeks, Carthaginians, and Romans. Native peoples of the peninsula, such as the Tartessos people, intermingled with the colonizers to create a uniquely Iberian culture. The Romans referred to the entire Peninsula as Hispania, from where the modern name of Spain originates."
  },
  {
    "civilizationId": 16,
    "history": [
      "The Teutons are a Central European civilization in Age of Empires II. They focus on infantry.",
      "The historical Teutons were first mentioned by Republican Roman authors as being from Scandinavia and allies with the Cimbri against Rome. The in-game \"Teutons\" actually represent many migration period's West Germanic-speaking peoples, East Francia, the Holy Roman Empire, Crusader states, and three famous crusading orders: the Knights Hospitaller, Knights Templar, and the Teutonic Knights. They rely on infantry, cavalry, siege units, and fortifications, which is typical for a medieval European army.",
      "Their army composition puts emphasis on \"slow, expensive, and powerful\" units, which is reflected by their unique unit, the Teutonic Knight, an expensive infantry unit with low mobility, but high attack and armor. Further emphasizing their slow and expensive army, their Barracks units and Paladins have extra melee armor, and their siege weapons are more durable thanks to their unique technology, but they lack mobility for cavalry due to the lack of Husbandry. The Teutons are the only non-Native American civilization to not have any upgrades to the Scout Cavalry line, which makes Teutons less ideal in low-gold situations, since their only reliable trash unit is their fully upgradable Halberdier with extra melee armor. Their Elite Skirmishers lack a few key upgrades as well.",
      "The Teutons are seen as a generic \"German\" civilization in the Age of Empires II timeframe, who also appear in Age of Empires III and Age of Empires IV as Germans and the Holy Roman Empire, respectively. In both installments, they share the same characteristic of the Teutons of being an infantry-focused civilization with a strong economy and defensive capacity."
    ]
  },
  {
    "civilizationId": 17,
    "history": [
      "The Turks are a Middle Eastern civilization in Age of Empires II. The Turks are based on the Oghuz Turks which included various Turkic dynasties (i.e. Seljuk Empire, Sultanate of Rum, and the Ottoman Empire). They focus on gunpowder units and their architecture group is Middle Eastern.",
      "The Turks are noted to be one of the most gold-intensive civilizations in the game, as they have some of the worst trash units in the game, being the only civilization to lack important upgrades for their Spearman and Skirmisher units. To compensate, the Turks' army composition puts emphasis on gold efficiency, as their Cavalry Archers are the tankiest in the game, they have free upgrades to their Light Cavalry line, free Chemistry, more durable gunpowder units (which includes their unique unit), and gold miners working faster.",
      "They are best suited in closed maps and team-game settings, as the former can allow them to go for a fast Imperial strategy, while the latter allow them to have a constant supply of gold through Trade for their army composition.",
      "The Turks also appear in Age of Empires III as the Ottomans. Much like the Turks, the Ottomans in Age of Empires III share the same characteristc of being a gunpowder/artillery-centric civilization that is Coin-intensive."
    ]
  },
  {
    "civilizationId": 18,
    "history": [
      "The Vikings are a Central European civilization in Age of Empires II. They are based on the Danes, Swedes, and Norwegians in the Viking Age. They focus on meatshield and anti-cavalry infantry and cheaper navy. Although they do a good job on land maps thanks to their good economy (even if their military is very situational), water maps are where they truly shine, thanks to their free Wheelbarrow and Hand Cart, as well as cost-effective ships with Longboat as their second unique unit.",
      "The Swedes, one of the Viking nations, are represented in Age of Empires III. Similar to the Vikings, they have an advantage in early economy, but are different in military, as the Swedes can train gunpowder units and have average cavalry. The Vikings also appear in Age of Mythology as the Norse. Much like the Vikings, the Norse have a solid economy and strong rushing potential (rushing strategies are preferred, since the Norse gain Favor through combat)."
    ]
  },
  {
    "civilizationId": 19,
    "history": "Berbers or Imazighen are an ethnic group indigenous to North Africa, specifically Morocco, Algeria, Tunisia, and Libya, and to a lesser extent Mauritania, northern Mali, and northern Niger. Smaller Berber populations are also found in Burkina Faso and Egypt's Siwa Oasis. Historically, Berber, or Amazigh, nations have spoken Berber languages, which are a branch of the Afroasiatic language family."
  },
  {
    "civilizationId": 20,
    "history": [
      "The Burmese are a Southeast Asian civilization in Age of Empires II HD: Rise of the Rajas. They focus on Monks and elephants. The Burmese are based on the Pagan Empire and the later Toungoo Empire, the latter of which is the largest empire in Southeastern Asia.",
      "The Burmese are noted to have very solid cavalry (especially Battle Elephants), infantry, and Monks, and very nearly every technology across the board. On the other hand, their archer units are the worst in the game, as they not only lack several key technologies, but they are the only civilization to lack Leather Archer Armor in their Blacksmith for their archers, forcing the Burmese to rely on their unique unit, Arambai (which is the main backbone of the Burmese cavalry army), and their below-average Heavy Cavalry Archer with Parthian Tactics their only viable anti-infantry options.",
      "The Arambai can be best described as a \"glass cannon\" cavalry archer (due to the lack of armor upgrades) with a very high attack and low accuracy, but stray shots can deal full damage that hit other units. This makes the Arambai very threatening when massed against clumped units close together.",
      "Due to their bonuses for both Monks and cavalry, they are very flexible in both open and closed maps, as the former have a solid early game economic and military bonuses that can allow the Burmese to push for an infantry rush and transition to their main strength with cavalry; while the latter can allow the Burmese to take full advantage of their late-game army composition Monks, Battle Elephants, and Arambai due to the closed and defensive nature of the map allow them to effectively boom up."
    ]
  },
  {
    "civilizationId": 21,
    "history": [
      "One of the oldest countries in Africa, the Ethiopian civilization emergence dates back over thousands of years. Due to migration and imperial expansion, it grew to include many other primarily Afro-Asiatic-speaking communities, including Amhara, Oromos, Somalis, Tigray, Afars, Sidama, Gurage, Agaw and Harari, among others.",
      "One of the early kingdoms to rise to power in the territory was the kingdom of D'mt in the 10th century BC, which established its capital at Yeha. In the first century AD the Aksumite Kingdom rose to power in the Tigray Region with its capital at Aksum and grew into a major power on the Red Sea, subjugating Yemen and Meroe. In the early fourth century, during the reign of Ezana, Christianity was declared the state religion. Ezana's reign is also when the Aksumites first identified themselves as \"Ethiopians\", and not long after, Philostorgius became the first foreign author to call the Aksumites Ethiopians.",
      "The Aksumite empire fell into decline with the rise of Islam in the Arabian peninsula, which slowly shifted trade away from the Christian Aksum. It eventually became isolated, its economy slumped and Aksum's commercial domination of the region ended. The Aksumites gave way to the Zagwe dynasty, who established a new capital at Lalibela before giving way to the Solomonic dynasty in the 13th century. During the early Solomonic period, Ethiopia went through military reforms and imperial expansion that allowed it to dominate the Horn of Africa. Portuguese missionaries arrived at this time."
    ]
  },
  {
    "civilizationId": 23,
    "history": "The Inca Empire, also known as the Incan Empire and the Inka Empire, and at the time known as the Realm of the Four Parts, was the largest empire in pre-Columbian America. The administrative, political and military center of the empire was in the city of Cusco. The Inca civilization arose from the Peruvian highlands sometime in the early 13th century. The Spanish began the conquest of the Inca Empire in 1532 and its last stronghold was conquered in 1572."
  },
  {
    "civilizationId": 24,
    "history": [
      "According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between 73,000 and 55,000 years ago. However, the earliest known human remains in South Asia date to 30,000 years ago. Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around 7000 BCE. At the site of Mehrgarh presence can be documented of the domestication of wheat and barley, rapidly followed by that of goats, sheep, and cattle.",
      "By 4500 BCE, settled life had spread more widely, and began to gradually evolve into the Indus Valley civilisation, an early civilisation of the Old World, which was contemporaneous with Ancient Egypt and Mesopotamia. This civilisation flourished between 2500 BCE and 1900 BCE in what today is Pakistan and north-western India, and was noted for its urban planning, baked brick houses, elaborate drainage, and water supply."
    ]
  },
  {
    "civilizationId": 25,
    "history": [
      "Italy is considered one of the birthplaces of Western civilization and a cultural superpower. Italian culture is the culture of the Italians, a Romance ethnic group, and is incredibly diverse spanning the entirety of the Italian peninsula and the islands of Sardinia and Sicily. Italy has been the starting point of phenomena of international impact such as the Roman Republic, Roman Empire, the Roman Catholic Church, the Maritime republics, Romanesque art, Scholasticism, the Renaissance, the Age of Discovery, Mannerism, the Scientific revolution, the Baroque, Neoclassicism, the Risorgimento, Fascism, and European integration.",
      "Italy was home to many well-known and influential civilizations, including Italic peoples such as the Etruscans, the Samnites and the Romans, while also hosting colonies from important foreign civilizations like the Phoenicians and the Greeks. Etruscan and Samnite cultures flourished in Italy before the emergence of the Roman Republic, which conquered and incorporated them. Phoenicians and Greeks established settlements in Italy beginning several centuries before the birth of Christ, and the Greek settlements in particular developed into thriving classical civilizations, for example the cities of Magna Graecia."
    ]
  },
  {
    "civilizationId": 27,
    "history": [
      "The Khmer are a Southeast Asian civilization introduced in Age of Empires II HD: Rise of the Rajas. The Khmer are based on the Khmer Empire, whose capital was Angkor (located in present Cambodia), one of the largest pre-industrial cities. They focus on siege weapons and elephant units, in their case Battle Elephants and Ballista Elephants.",
      "The Khmer are considered to be one of the most unconventional civilizations because of their civilization bonus, the ability to advance to the next age or build other buildings without requirements. This makes the Khmer very flexible when it comes to their build orders and opening up to unconventional and unpredictable strategies. At the same time, said civilization bonus can be seen as a double-edged sword; it can backfire on the player if used inappropriately. As such, the Khmer are designed for experienced players who can maximize the use of the civilization bonus.",
      "As noted, the Khmer are a siege-focused civilization with emphasis on Scorpions and Battle Elephants, which is also reflected in their unique unit, the Ballista Elephant. Subsequent balance patches in the Definitive Edition, however, push the Khmer more into a \"jack of all trades\" civilization, with infantry as their only noticeable weakness in their tech tree (which is fitting for a civilization that does not need pre-requisites to advance to the next age or build any building)."
    ]
  },
  {
    "civilizationId": 28,
    "history": "The Magyars are an Eastern European civilization introduced in Age of Empires II HD: The Forgotten. They focus on cavalry. They are primarily based on Medieval Hungarian people. Although they have very powerful military thanks to their fully upgraded cavalry, prominent archers, and excellent trash units, the other part is relatively weak and they do not have any early economic bonuses. For new players who want to practice economic distribution, the Magyars can be a very effective choice."
  },
  {
    "civilizationId": 29,
    "history": [
      "The Malians are an African civilization introduced in Age of Empires II HD: The African Kingdoms based on various western African kingdoms such as the Mali Empire and Songhai Empire. In game, they focus on infantry with a versatile technology tree.",
      "Despite not being too related, some elements of the Malians civilization (like infantry and cavalry bonuses, and the University bonus) are present in the Hausa civilization of Age of Empires III: Definitive Edition - The African Royals."
    ]
  },
  {
    "civilizationId": 30,
    "history": [
      "The Portuguese people represent a civilization in Civilization VI. They are led by João III, under whom their default colors are white and dark blue. They are available with the Portugal Pack, which was released on March 25, 2021.",
      "The Portuguese civilization ability is Casa da Índia, which restricts the destination of international Trade Route Trade Routes to coastal cities and cities with a Harbor, but grants a 50% bonus to their yields. It also gives their Traders increased range over water and the ability to embark as soon as they are unlocked. Their unique unit is the Nau (which replaces the Caravel), and their unique building is the Navigation School (which replaces the University)."
    ]
  },
  {
    "civilizationId": 31,
    "history": [
      "The Slavs are an Eastern European civilization introduced in Age of Empires II HD: The Forgotten based on various Rus principalities and city-states in western Russia, modern day Ukraine, and Belarus. They focus on infantry and siege weapons, with a solid economy on their farms and great cavalry, but lack key upgrades for their defenses, navy, and archers.",
      "The Slavs in-game represent the Russian civilization from Age of Empires III and the Rus civilization in Age of Empires IV. Some elements of the Slavs were separated in the Definitive Edition expansions with the introduction to Bulgarians, Bohemians, and Poles to differentiate from the umbrella Slavs civilization."
    ]
  },
  {
    "civilizationId": 32,
    "history": "The Vietnamese are an East Asian civilization introduced in Age of Empires II HD: Rise of the Rajas. They focus on archers. Gameplay-wise, the Vietnamese function as a \"support\" civilization in team-games that is more late-game oriented, as they give the most amount of team-related bonuses (revealing enemy Town Centers and giving their allies access to the Imperial Skirmisher upgrade). Because of their team-focused bonuses, the Vietnamese excel better in team game settings than in one-on-one matches (although various buffs in the Definitive Edition make the Vietnamese a decent civilization in one-on-one matches)."
  }
]
